In [132]:
import numpy as np
from numpy import nan as NA
import pandas as pd

In [133]:
data=pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [134]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

cleaned

     0    1    2
0  1.0  6.5  3.0

In [135]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [136]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.901105       NaN       NaN
1 -2.745336       NaN       NaN
2  0.934629       NaN -0.267914
3  0.367262       NaN -1.125568
4  1.344869  0.369434  0.524586
5  1.224897  0.096192  0.139126
6 -0.194195  0.242211  2.635229

In [137]:
df.dropna(thresh=2)

          0         1         2
2  0.934629       NaN -0.267914
3  0.367262       NaN -1.125568
4  1.344869  0.369434  0.524586
5  1.224897  0.096192  0.139126
6 -0.194195  0.242211  2.635229

In [138]:
df.fillna({1:0,2:0.5},inplace=True)
df

          0         1         2
0 -0.901105  0.000000  0.500000
1 -2.745336  0.000000  0.500000
2  0.934629  0.000000 -0.267914
3  0.367262  0.000000 -1.125568
4  1.344869  0.369434  0.524586
5  1.224897  0.096192  0.139126
6 -0.194195  0.242211  2.635229

In [139]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.777462  1.766915  1.187191
1  1.064407  1.171222 -1.705524
2  1.673914  1.171222  1.301667
3 -0.302572  1.171222  0.146203
4  0.045803       NaN  0.146203
5 -0.145798       NaN  0.146203

In [140]:
df[1]

0    1.766915
1    1.171222
2         NaN
3         NaN
4         NaN
5         NaN
Name: 1, dtype: float64

In [141]:
df.fillna({1:df[1].mean(),2:df[2].mean()})

          0         1         2
0  1.777462  1.766915  1.187191
1  1.064407  1.171222 -1.705524
2  1.673914  1.469068  1.301667
3 -0.302572  1.469068  0.146203
4  0.045803  1.469068  0.232384
5 -0.145798  1.469068  0.232384

In [142]:
val='a,b, guido'
pieces=[x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [143]:
'guido' in val

True

In [144]:
val.index(',')

1

In [145]:
val.find(":")

-1

In [146]:
val.count(',')

2

In [147]:
val.replace(',','::')

'a::b:: guido'

In [148]:
val.replace(',','')

'ab guido'

In [149]:
'::'.join(pieces)

'a::b::guido'

In [150]:
import re
text='foo bar\tbaz\tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [151]:
regex=re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [152]:
regex.findall(text)

[' ', '\t', '\t']

In [153]:
text = """
Dave: dave@google.com
Steve: steve@gmail.com
Rob: rob@gmail.com
Ryan: ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex=re.compile(pattern,flags=re.IGNORECASE)
#re.IGNORECASE는 정규표현식이 대소문자를 가리지 않도록 한다.
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [154]:
regex.search(text)

In [155]:
print(regex.match(text))

None

In [156]:
print(regex.sub('SUB',text))

Dave: SUB
Steve: SUB
Rob: SUB
Ryan: SUB

In [157]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex=re.compile(pattern,flags=re.IGNORECASE)
m=regex.match('cwoo505@naver.com dkssud231@goggle.com')
m.groups()

('cwoo505', 'naver', 'com')

In [158]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [159]:
sen=regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text)
print(sen)

Dave: Username:dave,Domain:google,Suffix:com
Steve: Username:steve,Domain:gmail,Suffix:com
Rob: Username:rob,Domain:gmail,Suffix:com
Ryan: Username:ryan,Domain:yahoo,Suffix:com

In [160]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}
data=pd.Series(data)
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [161]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [162]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [163]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [164]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [165]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [166]:
data.duplicated(['k1','v1'])
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [167]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [168]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [169]:
lowercased=data['food'].str.lower()
data['animal']=lowercased.map(meat_to_animal)
#data['food'].map(lambda x:meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [170]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [171]:
data.map(lambda x:np.nan if x==-999. else x)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [172]:
data.replace(-999.,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [174]:
data.replace([-999.,-1000],[np.nan,0.])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [175]:
data.replace({-999.:np.nan,-1000.:0.})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [177]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [182]:
data.index=data.index.map(lambda x:x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [183]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [186]:
data.rename({'OHIO':'Indiana'},inplace=True)
data

         one  two  three  four
Indiana    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [187]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [188]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [190]:
group_names=['Youth','YouthAdult','MiddleAged','Senior']
m=pd.cut(ages,bins,labels=group_names)
pd.value_counts(m)

Youth         5
YouthAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [191]:
data=np.random.rand(20)
data

array([0.02882035, 0.80286777, 0.04290956, 0.85796418, 0.37809381,
       0.462566  , 0.7010291 , 0.86237404, 0.33639754, 0.65148976,
       0.70212048, 0.21799153, 0.71375102, 0.80121179, 0.5672083 ,
       0.23648681, 0.34056667, 0.97846214, 0.59719872, 0.05755169])

In [192]:
pd.cut(data,4,precision=2)

[(0.028, 0.27], (0.74, 0.98], (0.028, 0.27], (0.74, 0.98], (0.27, 0.5], ..., (0.028, 0.27], (0.27, 0.5], (0.74, 0.98], (0.5, 0.74], (0.028, 0.27]]
Length: 20
Categories (4, interval[float64, right]): [(0.028, 0.27] < (0.27, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

In [196]:
data=np.random.rand(1000)
m=pd.qcut(data,4,precision=2)
pd.value_counts(m)

(-0.009918, 0.27]    250
(0.27, 0.51]         250
(0.51, 0.78]         250
(0.78, 1.0]          250
dtype: int64

In [211]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

            0         1         2         3
0    0.052175 -0.043915 -0.034306 -0.168443
1    0.915430  1.350164 -1.779509 -0.703957
2   -1.185300  0.453786  0.056857 -0.031341
3   -0.725205 -0.023287 -2.210922 -0.768307
4   -0.406179 -1.543618  1.045245 -0.734799
..        ...       ...       ...       ...
995 -0.581365 -0.977451 -1.165388 -1.162400
996  0.492870  1.655746  0.619347  0.119787
997  1.826616 -0.767890  0.081084  0.162872
998  0.503927 -0.428811 -0.912306  0.916304
999 -0.194318 -0.108110 -1.436094  0.644316

[1000 rows x 4 columns]

In [215]:
data[(np.abs(data)>3).any(1)]

/var/folders/l4/y_bsqjv51cg_wqy5xcj1b3940000gn/T/ipykernel_27150/2768852463.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data)>3).any(1)]

            0         1         2         3
36  -0.487007 -0.787745  0.005315  3.038702
121  0.892027 -0.323357 -3.008183  0.737565
150  0.240978 -0.780142  3.574761  1.813322
153 -0.835682  0.958522 -2.798214 -3.689336
158 -0.540484  1.643168 -3.236237  0.995507
186 -1.104408  0.171180  0.335262 -3.068829
233 -3.004216 -1.011205  0.157907 -0.519724
255  1.256648 -0.867440  0.561092  3.062380
337 -1.508591 -1.196201 -3.040845  1.532648
346  0.741210 -0.699293 -3.071495 -0.676557
360 -3.868062 -0.233047  1.138069 -0.311060
421 -0.570466  0.199869 -0.264422  3.653991
437  0.298820 -1.228203 -0.358735 -3.439526
674 -3.026559 -0.125037 -0.372801 -0.656683
918  3.627031 -0.090538  0.081043 -0.943591

In [219]:
data[np.abs(data)>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002955    -0.031726     0.001523    -0.004949
std       1.010985     0.991183     1.030423     1.026563
min      -3.000000    -2.812747    -3.000000    -3.000000
25%      -0.691453    -0.726505    -0.688406    -0.682326
50%       0.008792    -0.018448     0.006155    -0.042957
75%       0.689385     0.623005     0.734208     0.715808
max       3.000000     2.812372     3.000000     3.000000

In [220]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler=np.random.permutation(5)
sampler

array([0, 2, 4, 1, 3])

In [222]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [227]:
df.sample(n=300,replace=True)

     0   1   2   3
2    8   9  10  11
3   12  13  14  15
3   12  13  14  15
4   16  17  18  19
4   16  17  18  19
..  ..  ..  ..  ..
1    4   5   6   7
4   16  17  18  19
1    4   5   6   7
4   16  17  18  19
2    8   9  10  11

[300 rows x 4 columns]

In [230]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [232]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [240]:
dummies=pd.get_dummies(df['key'],prefix='key')
df_with_dummy=df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [241]:
mnames=['movie_id','title','genres']
movies=pd.read_table('examples/movies.dat',sep='::',
                     header=None,names=mnames)
movies[:10]

/var/folders/l4/y_bsqjv51cg_wqy5xcj1b3940000gn/T/ipykernel_27150/3060720800.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies=pd.read_table('examples/movies.dat',sep='::',

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [243]:
all_genres=[]
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres=pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [245]:
zero_matrix=np.zeros((len(movies),len(genres)))
dummies=pd.DataFrame(zero_matrix,columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [246]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [247]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [252]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[100]

movie_id                          102
title                Mr. Wrong (1996)
genres                         Comedy
Genre_Animation                   0.0
Genre_Children's                  0.0
Genre_Comedy                      1.0
Genre_Adventure                   0.0
Genre_Fantasy                     0.0
Genre_Romance                     0.0
Genre_Drama                       0.0
Genre_Action                      0.0
Genre_Crime                       0.0
Genre_Thriller                    0.0
Genre_Horror                      0.0
Genre_Sci-Fi                      0.0
Genre_Documentary                 0.0
Genre_War                         0.0
Genre_Musical                     0.0
Genre_Mystery                     0.0
Genre_Film-Noir                   0.0
Genre_Western                     0.0
Name: 100, dtype: object